In [48]:
import pandas as pd
import numpy as np

In [49]:
df = pd.read_csv(r'C:\Users\s1203137\xxx\employee_data.csv')

In [50]:
df.head(2)

   yyyy-mm  employee_id sex   level       salary  fte
0  2025-10          103   F  junior  1658.509537  1.0
1  2025-10          104   M  junior  1606.448209  1.0

In [51]:
df.shape

(61, 6)

In [52]:
df.columns

Index(['yyyy-mm', 'employee_id', 'sex', 'level', 'salary', 'fte'], dtype='object')

In [53]:
df.dtypes

yyyy-mm         object
employee_id      int64
sex             object
level           object
salary         float64
fte            float64
dtype: object

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   yyyy-mm      61 non-null     object
 1   employee_id  61 non-null     int64
 2   sex          61 non-null     object
 3   level        60 non-null     object
 4   salary       61 non-null     float64
 5   fte          61 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 3.0+ KB

In [55]:
df.describe()

       employee_id       salary        fte
count    61.000000    61.000000  61.000000
mean    180.180328  1659.392354   0.881148
std      48.624928   621.123031   0.191521
min     103.000000   701.464453   0.500000
25%     134.000000  1228.788537   0.750000
50%     176.000000  1606.448209   1.000000
75%     226.000000  2030.844970   1.000000
max     257.000000  3000.000000   1.000000

In [56]:
A = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]
np.quantile(A, [0.05, 0.95])

array([ 1.5, 10.5])

In [57]:
df.head()

   yyyy-mm  employee_id sex   level       salary   fte
0  2025-10          103   F  junior  1658.509537  1.00
1  2025-10          104   M  junior  1606.448209  1.00
2  2025-10          105   F  junior   765.189659  0.50
3  2025-10          110   F  junior  1228.788537  0.75
4  2025-10          112   F     mid  1996.799735  1.00

In [58]:
df['sex'] # pd.Series

0     F
1     M
2     F
3     F
4     F
     ..
56    F
57    F
58    F
59    F
60    M
Name: sex, Length: 61, dtype: object

In [59]:
df[['sex']] # pd.DataFrame

   sex
0    F
1    M
2    F
3    F
4    F
..  ..
56   F
57   F
58   F
59   F
60   M

[61 rows x 1 columns]

In [60]:
df.head()

   yyyy-mm  employee_id sex   level       salary   fte
0  2025-10          103   F  junior  1658.509537  1.00
1  2025-10          104   M  junior  1606.448209  1.00
2  2025-10          105   F  junior   765.189659  0.50
3  2025-10          110   F  junior  1228.788537  0.75
4  2025-10          112   F     mid  1996.799735  1.00

In [61]:
df.set_index('employee_id', inplace=True)

In [ ]:
print(df.query("sex == 'F'")['salary'].sum())

47574.80317270659